# HookAngle Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarHookType..::..HookAngle Property
RebarHookType Class See Also
---
The hook angle, measured in radians. Must be greater than 0 and no more than pi.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double HookAngle { get; set; }
```

Visual Basic
---
```text
Public Property HookAngle As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double HookAngle {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The given value for hookAngle is not a number |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: hookAngle must be greater than 0 and no more than pi. |

# See Also
RebarHookType Class
Autodesk.Revit.DB.Structure Namespace